tutorials/adsorbingSphere/0/fluid/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 1;

boundaryField
{
    fluid_to_solid
    {
        type                    regionCoupledScalarJump;
        interfaceType           defaultInterface;
        k                       "DH2O";

        accType                 fixed;
        relax                   1.0;

        // accType              aitken;
        // relax                0.75;

        // accType              IQN-ILS;
        // relax                0.75;
        // couplingReuse        0; //2;


        neighbourRegionName     solid;
        neighbourPatchName      solid_to_fluid;
        neighbourFieldName      H2O;
        secondOrder             false;
        nonOrthCorr             true;
        value                   $internalField;      
    }  
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
