tutorials/adsorbingSphere/constant/solid/sorbentProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sorbentProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Reaction rate and equilibria constants
k1		  k1 [0  6 -1 0 -2 0 0] 0.1;
K1		  K1 [0  3  0 0 -1 0 0] 1;
k2		  k2 [0  6 -1 0 -2 0 0] 0.1;
K2		  K2 [0  3  0 0 -1 0 0] 1;

HrCO2		HrCO2 [0 0 0 0 0 0 0] 0.83;
HrH2O		HrH2O [0 0 0 0 0 0 0] 0.13;

// ************************************************************************* //
