tutorials/adsorbingSphere/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    CO2
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    	faceAreaPair;
        mergeLevels     	1;
        minIter         	2;
        maxIter         	50;
    };
    H2O
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    	faceAreaPair;
        mergeLevels     	1;
        minIter         	2;
        maxIter         	50;
    };    
    T
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    	faceAreaPair;
        mergeLevels     	1;
        minIter         	2;
        maxIter         	50;
    };

    Tcoupled
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  Cholesky;
        }

        tolerance        1e-8;
        relTol           0;

        minIter          0;
        maxIter          200;
    };
    U 
    {
        relTol 0.0;
        smoother GaussSeidel;
        tolerance 1e-05;
        solver smoothSolver;
    }
    p
    {
        solver          BICCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
    pcorr
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    pcorrMesh
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    pFinal
    {
        solver          BICCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;

    residualControl
    {
        T               1e-5;
    }
}

PISO
{
    pRefPoint (0 0 0); 
    pRefValue 0;
}

PIMPLE
{
    // p-U coupling
    nOuterCorrectors            3; // SIMPLEC loops
    nCorrectors                 2; // PISO loops
    nNonOrthogonalCorrectors    1;

    residualControl
    {
        p
        {
            relTol         0;
            tolerance      0;
        }

        U
        {
            relTol         0;
            tolerance      0;
        }
    }
}

relaxationFactors
{
	T	1.0;
}



// ************************************************************************* //
